/*********************************
**          Copyright.          **
**  Suzumiya Haruhi no Yuuutsu  **
**  Syoushitsu Episode III      **
**  YUKI.N(Yuki Nagato) Script  **
**  Coded by "Nagisa."          **
**                              **
**  No reproduction or          **
**   republication without      **
**        written permission.   **
**********************************/
/*
   Script Reference
      ->ScriptReference.html

Copyright / Quote specify > https://130cmwolf.github.io/YUKI.N/Engine.js
*/
var BASE = "YUKI.N>";
var TYPESTR = new Array(
"*6000",
"t120",
"+これをあなたが読んでいる時、",
"/わたしはわたしではないだろう。",
"*1000",
"t110",
"&･･････そうだよ。その通りだよ。長門･･････。",
"*1000",
"%100,1000",
"*1000",
"t120",
"+このメッセージが表示されたということは、",
"*200",
"/そこにはあなた、わたし、涼宮ハルヒ、朝比奈みくる、古泉一樹が",
"/存在しているはずである。",
"*3000",
"+それが鍵。",
"*500",
"/あなたは解答を見つけ出した。",
"*1000",
"t100",
"&俺の出した解答じゃないんだ。",
"*200",
"&古泉を伴ってハルヒが勝手に押しかけてきたんだよ。",
"*200",
"&こっちのハルヒもなかなか役に立つじゃないか･･････。",
"*700",
"&それにしても長門、数日ぶりだな。",
"*1000",
"%100,1000",
"*1000",
"t120",
"+これは緊急脱出プログラムである。",
"*500",
"/起動させる場合はエンターキーを、",
"/そうでない場合はそれ以外のキーを選択せよ。",
"*500",
"/起動させた場合、あなたは時空修正の機会を得る。",
"*500",
"/ただし成功は保証できない。",
"*500",
"/また帰還の保証もできない。",
"*1000",
"t100",
"&緊急脱出──プログラム。これが。このパソコンが。",
"*500",
"t120",
"+このプログラムが起動するのは一度きりである。",
"*500",
"/実行ののち、消去される。",
"/非実行が選択された場合は起動せずに消去される。",
"*700",
"/Ready?",
"*10000",
"%100,1000",
"&引用・涼宮ハルヒの消失 第三章",
"&©2006 谷川流・いとうのいぢ/SOS団",
"&Coded by なぎさ。");

document.write('<div id="Typingmain"><\/div>\n');
document.write('<script src="Engine.js"><\/script>');
