/*********************************
**          Copyright.          **
**  Suzumiya Haruhi no Yuuutsu  **
**  No.14 Episode VI            **
**  YUKI.N(Yuki Nagato) Script  **
**  Coded by "Nagisa."          **
**                              **
**  No reproduction or          **
**   republication without      **
**        written permission.   **
**********************************/
/*
   Script Reference
      ->ScriptReference.html

Copyright / Quote specify > https://130cmwolf.github.io/YUKI.N/Engine.js
*/
var BASE = "YUKI.N>";
var TYPESTR = new Array(
"*6000",
"t98",
"+みえてる？",
"*6000",
"t200",
"-あ",
"-ああ",
"*800",
"t90",
"+そっちの時空間とは",
"/まだ完全には連結を絶たれていない。",
"/でも時間の問題。",
"/そうなれば最後。",
"*1500",
"t150",
"-ｄ",
"-ど",
"-どう",
"-どうｓ",
"-どうす",
"-どうすｒ",
"-どうすｒｙ",
"-どうすりゃ",
"-どうすりゃい",
"-どうすりゃいい",
"-どうすりゃいい？",
"*1000",
"t98",
"+どうにもならない。",
"/情報統合思念体は失望している。",
"*500",
"/これで進化の可能性は失われた。",
"*1000",
"%30,1000",
"+涼宮ハルヒは",
"/何もない所から",
"/情報を生み出す力を",
"/持っていた。",
"*500",
"/それは情報統合思念体にも",
"/ない力。",
"*500",
"/この情報創造能力を解析すれば",
"/自律進化への糸口が",
"/つかめるかもしれないと考えた。",
"*1000",
"%40,1000",
"*2000",
"t100",
"+あなたに賭ける。",
"*1000",
"t120",
"-ｎ",
"-な",
"-なｎ",
"-なに",
"-なにｗ",
"-なにを",
"-何を",
"-何をｄ",
"-何をだ",
"-何をだｙ",
"-何をだよ",
"*800",
"t98",
"+もう一度こちらへ回帰することを",
"/我々は望んでいる。",
"*600",
"/涼宮ハルヒは重要な観察対象。",
"*300",
"/わたしという個体も",
"/あなたには戻ってきて欲しいと感じている。",
"*1000",
"%30,1000",
"*500",
"t100",
"a7,400",
"+また図書館に",
"*1000",
"%80,1000",
"*1000",
"t98",
"+sleeping beauty",
"*900",
"%100,5000",
"&引用・TVアニメ涼宮ハルヒの憂鬱 第14話 「涼宮ハルヒの憂鬱Ⅵ」",
"&©2006 谷川流・いとうのいぢ/SOS団",
"&Coded by なぎさ。");

document.write('<div id="Typingmain"><\/div>\n');
document.write('<script src="Engine.js"><\/script>');
